[
    {
        "id": 1,
        "name": "McChicken",
        "image": "https://cdn.mcdonalds.pl/uploads/20221109152407/mcchiken.png",
        "price": 5.99,
        "description": "The McChicken is a chicken sandwich sold by the international fast food restaurant chain McDonald's. The McChicken consists of a toasted, buttered bun, a mayonnaise-based sauce, shredded lettuce, and a breaded chicken patty."
    },
    {
        "id": 2,
        "name": "Cheeseburger",
        "image": "https://cdn.mcdonalds.pl/uploads/20220922160220/cheeseburger.png",
        "price": 3.99,
        "description": "A cheeseburger is a hamburger topped with cheese. Traditionally, the slice of cheese is placed on top of the meat patty, but the burger can include many variations in structure, ingredients, and composition." 
    },
    {
        "id": 3,
        "name": "WieśMac",
        "image": "https://cdn.mcdonalds.pl/uploads/20220922161306/wies-mac.png",
        "price": 6.99,
        "description": "The McFeast is a hamburger sold by the international fast food restaurant chain McDonald's. It was introduced in 1977 as the first premium burger McDonald's sold."
    },
    {
        "id": 4,
        "name": "frytki",
        "image": "https://cdn.mcdonalds.pl/uploads/20221109151634/07-01-frytki-singlepage-copy.png",
        "price": 2.99,
        "description": "French fries, or simply fries, chips, finger chips, or French-fried potatoes, are batonnet or allumette-cut deep-fried potatoes."
    },
    {
        "id": 5,
        "name": "McFlurry",
        "image": "https://cdn.mcdonalds.pl/uploads/20211015141015/skomponuj-mcflurry-1090x664px-2.png",
        "price": 3.99,
        "description": "McFlurry is a brand of flavored ice cream distributed by the international fast food restaurant chain McDonald's. It was first introduced in 1997 in Canada, then rolled out to the United States in 1998."
    },
    {
        "id": 6,
        "name": "Ciastko jabłkowe",
        "image": "https://cdn.mcdonalds.pl/uploads/20210608163713/opt/mcd-www-singlepage-ciastko-jablko-1.png",
        "price": 1.99,
        "description": "Apple pie is a fruit pie in which the principal filling ingredient is apple, originated in England. It is often served with whipped cream, ice cream, or cheddar cheese."
    }
]